# ViewSheetSetting Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintManager..::..ViewSheetSetting Property
PrintManager Class See Also
---
The ViewSheetSetting which manages the view/sheet set information of current document, and you can change the default view/sheet set for current project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ViewSheetSetting ViewSheetSetting { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ViewSheetSetting As ViewSheetSetting
	Get
```

Visual C++
---
```text
public:
property ViewSheetSetting^ ViewSheetSetting {
	ViewSheetSetting^ get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the print range is not selected views/sheets. |

# See Also
PrintManager Class
Autodesk.Revit.DB Namespace